Repository: juan-hamon/Othello
Catalog: lib/config/localization/app_*.arb
Languages: es

# mainTitle
source: Welcome to the Othello Game!
es: Bienvenido al juego Othello

# statGameText
source: Start Game
es: Empezar el juego

# playerCardTitle
source: Player {numPlayer}
es: Jugador {numPlayer}

# playerSelectColor
source: Select your color
es: Selecciona tu color

# playerNameHint
source: Player name
es: Nombre del jugador

# enableDiagonalsOption
source: Enable Diagonals
es: Habilitar diagonales

# changeBoardSizeOption
source: Change Board Size
es: Cambiar tamaño del tablero

# settingsTitle
source: Settings
es: Configuración

# appearanceTitle
source: Appearance
es: Apariencia

# lightThemOption
source: Light Theme
es: Tema claro

# darkThemeOption
source: Dark Theme
es: Tema oscuro

# languageTitle
source: Language
es: Idioma

# englishOption
source: English
es: Inglés

# spanishOption
source: Spanish
es: Español

# doneButtonText
source: Done
es: Listo

# warningTitle
source: Warning
es: Alerta

# sameNameErrorText
source: Player names cannot be the same.
es: Los nombres de los jugadores no pueden ser iguales.

# sameColorErrorText
source: Player colors cannot be the same.
es: Los colores de los jugadores no pueden ser iguales.

# noColorChosenText
source: At least one player didn't chose a color, both players must chose a color.
es: Al menos un jugador no eligió un color, ambos jugadores deben elegir un color.

# okButtonText
source: Ok
es: Entendido

# invalidMovementText
source: That movement is not valid
es: Ese es un movimiento inválido

# noMorePiecesText
source: {player} has lost the game, there are no pieces of his/her color.
es: {player} perdió el juego, no quedan fichas de su color.

# noMoreMovementsText
source: {player} has lost the game, there are no more possible movements.
es: {player} perdió el juego, no tiene más movimientos posibles.

# drawGameText
source: Both players have the same amount of pieces, so it's a draw.
es: Ambos jugadores tienen la misma cantidad de fichas, por lo que es un empate.

# winnerText
source: {player} wins with {numPieces} pieces on the board!!!
es: {player} ganó con {numPieces} piezas en el tablero!!!

# lostKey
source: lost
es: perdió

# winKey
source: win
es: ganó

# drawKey
source: draw
es: empate

# defeatTitleText
source: Defeat
es: Derrota

# victoryTitleText
source: Victory
es: Victoria

# drawTitleText
source: Draw
es: Empate

# hideDialogButtonText
source: Hide Dialog
es: Esconder alerta

# goToMenuButtonText
source: Go to menu
es: Volver al inicio
